ТОИР_демо/src/Documents/торо_ГрафикРегламентныхМероприятийТОиР/торо_ГрафикРегламентныхМероприятийТОиР.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>торо_ГрафикРегламентныхМероприятийТОиР</name>
  <basedOn>Document.торо_ГрафикРегламентныхМероприятийТОиР</basedOn>
  <registerRecords>InformationRegister.торо_ЗапланированныеМероприятияОбъектов</registerRecords>
  <registerRecords>InformationRegister.торо_Ремонты</registerRecords>
  <registerRecords>InformationRegister.торо_СоответствиеКорректировокДокументамППР</registerRecords>
  <registerRecords>InformationRegister.торо_ПериодыПланированияППР</registerRecords>
  <registerRecords>InformationRegister.торо_ПлановыеМероприятия</registerRecords>
  <attributes>
    <name>ДатаПланирования</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПериодов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодичностьДетализации</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>ФлагВыводДиаграммы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусДокумента</name>
    <type>
      <types>CatalogRef.торо_СтатусыСогласованияДокументовРемонтныхРабот</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособСогласования</name>
    <type>
      <types>CatalogRef.торо_СпособыСогласованияДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.торо_ВидыОперацийПланаГрафикаППР</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.торо_ГрафикРегламентныхМероприятийТОиР</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПланРемонтов</name>
    <attributes>
      <name>ID</name>
      <comment>ID ремонта</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СписокОбъектовРемонта</name>
      <type>
        <types>CatalogRef.торо_СписокОбъектовРегламентногоМероприятия</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидРемонтныхРабот</name>
      <type>
        <types>CatalogRef.торо_ВидыРемонтов</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаКон</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНач</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef.торо_ГрафикРегламентныхМероприятийТОиР</types>
      </type>
    </attributes>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>CatalogRef.СтруктураПредприятия</types>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>СпособВыполнения</name>
      <type>
        <types>EnumRef.СпособыСтроительства</types>
      </type>
    </attributes>
    <attributes>
      <name>Отменен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
    <attributes>
      <name>Замещен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ID_базы_расчета</name>
      <comment>Id базы расчета</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ID_замещающего</name>
      <comment>Id замещающего</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачСт</name>
      <comment>Дата начала ремонтных работ планируемая</comment>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаКонСт</name>
      <comment>Дата окончания ремонтных работ планируемая</comment>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗамещенСт</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаРемонта</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Маршруты</name>
    <attributes>
      <name>СписокОбъектовРемонта</name>
      <type>
        <types>CatalogRef.торо_СписокОбъектовРегламентногоМероприятия</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидМероприятия</name>
      <type>
        <types>CatalogRef.торо_ВидыРемонтов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОбъектыМаршрутов</name>
    <attributes>
      <name>СписокОбъектовРемонта</name>
      <type>
        <types>CatalogRef.торо_СписокОбъектовРегламентногоМероприятия</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбъектРемонта</name>
      <type>
        <types>CatalogRef.торо_ОбъектыРемонта</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИсторияСтатусов</name>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗаКого</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусДокумента</name>
      <type>
        <types>CatalogRef.торо_СтатусыСогласованияДокументовРемонтныхРабот</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Согласующие</name>
    <attributes>
      <name>Согласующий</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Согласовано</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроведениеДокумента</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Порядок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусДокумента</name>
      <type>
        <types>CatalogRef.торо_СтатусыСогласованияДокументовРемонтныхРабот</types>
      </type>
    </attributes>
    <attributes>
      <name>Замещающий</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ТОИР_демо/src/Enums/СпособыСтроительства/СпособыСтроительства.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыСтроительства</name>
  <enumValues>
    <name>Подрядный</name>
    <comment>С привлечением подрядных организаций</comment>
  </enumValues>
  <enumValues>
    <name>Хозспособ</name>
    <comment>Строительство собственными силами</comment>
  </enumValues>
</mdclass:Enum>

ТОИР_демо/src/Documents/торо_ГрафикРегламентныхМероприятийТОиР/Forms/ФормаАвтозаполненияИсполнителей/Module.bsl
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ДокументППР") Тогда
		ДокументППР = Параметры.ДокументППР;
	КонецЕсли;
	
	Если Параметры.Свойство("ТаблицаРемонтовИзППР") Тогда
		ТаблицаРемонтовИзППР.Загрузить(Параметры.ТаблицаРемонтовИзППР.Выгрузить());
	Иначе
		ТаблицаРемонтовИзППР.Загрузить(ДокументППР.ПланРемонтов.Выгрузить());
	КонецЕсли;
	
	Элементы.ДокументППР.Заголовок = Строка(ДокументППР);
	
	ТолькоДляНеустановленныхИсполнителей = Истина;
	НеОчищатьИсполнителей = Истина;
	НеМенятьСпособВыполнения = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьФлажки(Элементы.ТаблицаРемонтовИзППРУстановитьФлажки);
	
	УстановитьДоступностьКонтрагентаПодразделения();

КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СпособВыполненияПриИзменении(Элемент)
	УстановитьДоступностьКонтрагентаПодразделения();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура УстановитьФлажки(Команда)
	
	Для каждого СтрокаТабличнойЧасти Из ТаблицаРемонтовИзППР Цикл
		СтрокаТабличнойЧасти.Пометка = Истина;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлажки(Команда)
	
	Для каждого СтрокаТабличнойЧасти Из ТаблицаРемонтовИзППР Цикл
		СтрокаТабличнойЧасти.Пометка = Ложь;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ИнвертироватьФлажки(Команда)
	
	Для каждого СтрокаТабличнойЧасти Из ТаблицаРемонтовИзППР Цикл
		СтрокаТабличнойЧасти.Пометка = Не СтрокаТабличнойЧасти.Пометка;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьИсполнителей(Команда)
	
	СтруктураВозврата = ПолучитьПредопределенныеЗначенияНаСервере();
	СпособыСтроительстваПустаяСсылка = СтруктураВозврата.СпособыСтроительстваПустаяСсылка;
	СпособыСтроительстваХозспособ = СтруктураВозврата.СпособыСтроительстваХозспособ;
	СпособыСтроительстваПодрядный = СтруктураВозврата.СпособыСтроительстваПодрядный;
	СтруктураПредприятияПустаяСсылка = СтруктураВозврата.СтруктураПредприятияПустаяСсылка;
	КонтрагентыПустаяСсылка = СтруктураВозврата.КонтрагентыПустаяСсылка;
	
	Для каждого СтрокаТабличнойЧасти Из ТаблицаРемонтовИзППР Цикл
		Если СтрокаТабличнойЧасти.Пометка Тогда 
			
			Если СтрокаТабличнойЧасти.СпособВыполнения = Неопределено 
				ИЛИ СтрокаТабличнойЧасти.СпособВыполнения = СпособыСтроительстваПустаяСсылка
				ИЛИ НЕ НеМенятьСпособВыполнения Тогда
				Если Не СтрокаТабличнойЧасти.СпособВыполнения = СпособВыполнения Тогда
					СтрокаТабличнойЧасти.СпособВыполнения = СпособВыполнения;
					СтрокаТабличнойЧасти.Исполнитель = Неопределено
				КонецЕсли;
			КонецЕсли;
			Если СтрокаТабличнойЧасти.СпособВыполнения = СпособыСтроительстваХозспособ Тогда 
				Если НЕ Подразделение = СтруктураПредприятияПустаяСсылка 
					или (Подразделение = СтруктураПредприятияПустаяСсылка и НЕ НеОчищатьИсполнителей) Тогда 
					Если СтрокаТабличнойЧасти.Исполнитель = СтруктураПредприятияПустаяСсылка
						или НЕ ТолькоДляНеустановленныхИсполнителей 
						или СтрокаТабличнойЧасти.Исполнитель = Неопределено 
						или (ТолькоДляНеустановленныхИсполнителей и СтрокаТабличнойЧасти.Исполнитель = Неопределено)Тогда 
						СтрокаТабличнойЧасти.Исполнитель = Подразделение;
					КонецЕсли;
				КонецЕсли;
			ИначеЕсли СтрокаТабличнойЧасти.СпособВыполнения = СпособыСтроительстваПодрядный Тогда 
				Если Не Контрагент = КонтрагентыПустаяСсылка
					или (Контрагент = КонтрагентыПустаяСсылка и НЕ НеОчищатьИсполнителей) Тогда 
					Если СтрокаТабличнойЧасти.Исполнитель = КонтрагентыПустаяСсылка 
						или НЕ ТолькоДляНеустановленныхИсполнителей
						или СтрокаТабличнойЧасти.Исполнитель = Неопределено 
						или (ТолькоДляНеустановленныхИсполнителей и (СтрокаТабличнойЧасти.Исполнитель = КонтрагентыПустаяСсылка или СтрокаТабличнойЧасти.Исполнитель = Неопределено))Тогда 
						СтрокаТабличнойЧасти.Исполнитель = Контрагент;
					КонецЕсли;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	Закрыть(ТаблицаРемонтовИзППР);
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервереБезКонтекста
Функция ПолучитьПредопределенныеЗначенияНаСервере()
	
	Возврат Новый Структура("СпособыСтроительстваПустаяСсылка, СпособыСтроительстваХозспособ, СпособыСтроительстваПодрядный, СтруктураПредприятияПустаяСсылка, КонтрагентыПустаяСсылка",
	Перечисления.СпособыСтроительства.ПустаяСсылка(), Перечисления.СпособыСтроительства.Хозспособ, Перечисления.СпособыСтроительства.Подрядный, Справочники.СтруктураПредприятия.ПустаяСсылка(), Справочники.Контрагенты.ПустаяСсылка());
	
Конецфункции

&НаКлиенте
Процедура УстановитьДоступностьКонтрагентаПодразделения()
	
	СпособВыполненияЗаполнен = ЗначениеЗаполнено(СпособВыполнения);
	ДоступностьЭлементов = (СпособВыполнения = ПредопределенноеЗначение("Перечисление.СпособыСтроительства.Хозспособ"));
	Элементы.Контрагент.Доступность = СпособВыполненияЗаполнен И НЕ ДоступностьЭлементов;
	Элементы.Подразделение.Доступность = СпособВыполненияЗаполнен И ДоступностьЭлементов;
	
	Если НЕ Элементы.Контрагент.Доступность Тогда
		Контрагент = ПредопределенноеЗначение("Справочник.Контрагенты.ПустаяСсылка");
	КонецЕсли;
	
	Если НЕ Элементы.Подразделение.Доступность Тогда
		Подразделение = ПредопределенноеЗначение("Справочник.СтруктураПредприятия.ПустаяСсылка");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
